/*
Напишите функцию `findUniqueElements`, которая принимает массив и возвращает новый массив, содержащий только уникальные элементы из исходного массива.

**Входные данные:**

- **`array`**: Массив, который может содержать повторяющиеся элементы.

**Выходные данные:**

- Массив, содержащий только уникальные элементы из исходного массива.

**Пример использования:**
`findUniqueElements([1, 2, 3, 2, 1, 4])` вернёт `[1, 2, 3, 4]`.

Подсказка: можно использовать функцию `includesElement`, которую мы написали ранее. Переписывать её не нужно, она доступна по всему проекту за счёт hoisting.
*/

// Функция находит уникальные элементы массива
function findUniqueElements(array) {
    // Создаем пустой массив для хранения уникальных значений
    let uniqueArray = [];

    // Проходим по каждому элементу исходного массива
    for (let i = 0; i < array.length; i++) {
        // Проверяем, содержится ли текущий элемент в uniqueArray
        if (!uniqueArray.includes(array[i])) {
            // Если нет, добавляем его в uniqueArray
            uniqueArray.push(array[i]);
        }
    }

    // Возвращаем массив уникальных элементов
    return uniqueArray;
}

console.log(findUniqueElements([1, 2, 3, 3, 4]));
